In [1]:
import pandas as pd

In [6]:
df = pd.read_csv("D:\\Learning\\Python\\ineuron classes\\Full-Stack-Data-Scientist\\social_net_ads.csv")

In [9]:
df = df.iloc[:,2:]

In [10]:
df

      Age  EstimatedSalary  Purchased
0    19.0          19000.0          0
1    35.0          20000.0          0
2    26.0          43000.0          0
3    27.0          57000.0          0
4    19.0          76000.0          0
..    ...              ...        ...
395  46.0          41000.0          1
396  51.0          23000.0          1
397  50.0          20000.0          1
398  36.0          33000.0          0
399  49.0          36000.0          1

[400 rows x 3 columns]

# Train test split

In [12]:
from sklearn.model_selection import train_test_split

In [13]:
df.drop("Purchased",axis=1)

      Age  EstimatedSalary
0    19.0          19000.0
1    35.0          20000.0
2    26.0          43000.0
3    27.0          57000.0
4    19.0          76000.0
..    ...              ...
395  46.0          41000.0
396  51.0          23000.0
397  50.0          20000.0
398  36.0          33000.0
399  49.0          36000.0

[400 rows x 2 columns]

In [ ]:
train_test_split(df.drop("Purchased"),axis=1)